#include <stdio.h>

int main(void)
{
    char a[4][3][2] = { { {'a', 'b'}, {'c', 'd'}, {'e', 'f'} },
		                { {'g', 'h'}, {'i', 'j'}, {'k', 'l'} },
		                { {'m', 'n'}, {'o', 'p'}, {'q', 'r'} },
		                { {'s', 't'}, {'u', 'v'}, {'w', 'x'} } };

    char (*pa)[2] = &a[1][0];   // pa指向a[4][3][2]数组的最底层单位{ , }，且从{g, h}开始
    char (*ppa)[3][2] = &a[1];  // ppa指向a[4][3][2]数组的最高层{ { , }, { , }, { , } }，且从{ {'g', 'h'}, {'i', 'j'}, {'k', 'l'} }开始

    /* 要想通过pa或ppa访问数组a中的'r'元素，分别应该怎么写？ */
    
    char r1, r2;
    r1 = *(*(pa + 5) + 1);
    // r1 = pa[5][1];
    r2 = *(*(*(ppa + 1) + 2)+1);
    // r2 = ppa[1][2][1];

    printf("%c, %c",r1, r2);

    return 0;
}


